[
    {
    "name": "Hibiscus",
    "description": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. They are native to warm temperate, subtropical, and tropical regions throughout the world.",
    "origin": "Warm temperate, subtropical, and tropical regions worldwide",
    "uses": "Hibiscus flowers are commonly used for ornamental purposes, landscaping, and as a source of herbal tea. In many cultures, they also hold symbolic significance and are used in ceremonies and rituals.",
    "cultivation": "Hibiscus plants prefer full sun and well-drained soil. They are relatively easy to grow and can be propagated from seeds, cuttings, or grafting.",
    "imageUrl": "https://images.pexels.com/photos/1133957/pexels-photo-1133957.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Hibiscus flowers vary in color and size depending on the species and cultivar. They typically have five petals and a prominent stamen.",
    "instructions": "Plant hibiscus in well-drained soil with good organic matter. Water regularly, especially during dry periods, and fertilize lightly during the growing season.",
    "water": "Hibiscus plants require regular watering, especially during dry periods and flowering.",
    "sunlight": "Full sun for at least 6-8 hours a day.",
    "diseases": "Common diseases include fungal infections, aphids, and whiteflies.",
    "solutions": "Practice good garden hygiene, prune infected branches, apply insecticidal soap or neem oil for pests, and use fungicides if necessary.",
    "fertilizers": "Apply a balanced fertilizer during the growing season, but avoid excessive nitrogen, which can promote vegetative growth over flowering.",
    "season": "Spring to fall"
    },
    {
    "name": "Jasmine",
    "description": "Jasmine is a genus of shrubs and vines in the olive family, Oleaceae. They are native to tropical and warm temperate regions of Eurasia, Australasia, and Oceania.",
    "origin": "Tropical and warm temperate regions of Eurasia, Australasia, and Oceania",
    "uses": "Jasmine flowers are prized for their sweet fragrance and are commonly used in perfumery, aromatherapy, and teas. They also hold symbolic significance in many cultures and are used in ceremonies and rituals.",
    "cultivation": "Jasmine plants prefer full sun to partial shade and well-drained soil. They can be grown as shrubs, vines, or container plants.",
    "imageUrl": "https://images.pexels.com/photos/7859590/pexels-photo-7859590.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Jasmine flowers are typically white or yellow and have a star-like shape with five petals. They bloom profusely and emit a strong, sweet fragrance, especially in the evening.",
    "instructions": "Plant jasmine in well-drained soil with good organic matter. Water regularly, especially during dry periods, and provide support for climbing varieties.",
    "water": "Jasmine plants require regular watering, especially during dry periods and flowering.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Common diseases include fungal infections, aphids, and whiteflies.",
    "solutions": "Practice good garden hygiene, prune infected branches, apply insecticidal soap or neem oil for pests, and use fungicides if necessary.",
    "fertilizers": "Apply a balanced fertilizer during the growing season, but avoid excessive nitrogen, which can promote vegetative growth over flowering.",
    "season": "Spring to fall"
    },
    {
    "name": "Marigold",
    "description": "Marigolds are flowering plants in the genus Tagetes, native to the Americas. They are widely cultivated for their bright and colorful flowers, which are used ornamentally, medicinally, and in religious ceremonies.",
    "origin": "Americas",
    "uses": "Marigold flowers are commonly used for ornamental purposes, landscaping, and as companion plants to repel pests. They are also used in traditional medicine and as offerings in religious rituals.",
    "cultivation": "Marigolds prefer full sun and well-drained soil. They are relatively easy to grow and can be propagated from seeds or transplants.",
    "imageUrl": "https://images.pexels.com/photos/3524048/pexels-photo-3524048.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Marigold flowers come in various colors, including yellow, orange, and red, and have a distinctive pungent odor. They typically have dense, bushy foliage.",
    "instructions": "Plant marigolds in well-drained soil with good organic matter. Water regularly, especially during dry periods, and deadhead spent flowers to encourage continuous blooming.",
    "water": "Marigolds require regular watering, especially during dry periods and flowering.",
    "sunlight": "Full sun for at least 6-8 hours a day.",
    "diseases": "Common diseases include powdery mildew, bacterial leaf spot, and root rot.",
    "solutions": "Practice good garden hygiene, space plants adequately for air circulation, avoid overhead watering, and treat with fungicides if necessary.",
    "fertilizers": "Marigolds are relatively low-maintenance and do not require heavy fertilization. A balanced fertilizer applied at planting time is usually sufficient.",
    "season": "Spring to fall"
    },
    {
    "name": "Balsam",
    "description": "Balsam is a genus of flowering plants in the family Balsaminaceae. They are native to tropical and subtropical regions of Africa, Asia, and the Americas.",
    "origin": "Tropical and subtropical regions of Africa, Asia, and the Americas",
    "uses": "Balsam flowers are commonly grown for their bright and colorful blooms, which are used ornamentally and in traditional medicine. They are also used in religious ceremonies and rituals.",
    "cultivation": "Balsam plants prefer full sun to partial shade and well-drained soil. They are relatively easy to grow and can be propagated from seeds or cuttings.",
    "imageUrl": "https://t3.ftcdn.net/jpg/07/30/73/02/240_F_730730207_h0H5c842RMPaR6qh67v7Nas1E2DHbE22.jpg",
    "details": "Balsam flowers come in various colors, including red, pink, purple, and white, and have a distinctive spurred shape. They typically have succulent stems and lance-shaped leaves.",
    "instructions": "Plant balsam in well-drained soil with good organic matter. Water regularly, especially during dry periods, and deadhead spent flowers to encourage continuous blooming.",
    "water": "Balsam plants require regular watering, especially during dry periods and flowering.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Common diseases include powdery mildew, damping-off, and root rot.",
    "solutions": "Practice good garden hygiene, space plants adequately for air circulation, avoid overhead watering, and treat with fungicides if necessary.",
    "fertilizers": "Balsam plants are relatively low-maintenance and do not require heavy fertilization. A balanced fertilizer applied at planting time is usually sufficient.",
    "season": "Spring to fall"
    },
    {
    "name": "Royal Poinciana",
    "description": "Royal poinciana, also known as flamboyant tree or flame tree, is a species of flowering plant in the pea family, Fabaceae. It is native to Madagascar but has been widely planted as an ornamental tree in tropical and subtropical regions worldwide.",
    "origin": "Madagascar",
    "uses": "Royal poinciana is grown primarily for its striking, flame-colored flowers and ornamental value. It is often used as a shade tree in parks, gardens, and urban landscapes.",
    "cultivation": "Royal poinciana trees prefer full sun and well-drained soil. They are relatively easy to grow from seeds or transplants but require ample space to accommodate their large size.",
    "imageUrl": "https://images.pexels.com/photos/12530962/pexels-photo-12530962.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Royal poinciana trees are deciduous and can grow up to 30-40 feet tall with a spread of 40-60 feet. They have fern-like foliage and produce large clusters of red, orange, or yellow flowers.",
    "instructions": "Plant royal poinciana in well-drained soil with good organic matter. Water regularly, especially during the growing season, and provide ample space for the tree to spread.",
    "water": "Royal poinciana trees require regular watering, especially during periods of drought and flowering.",
    "sunlight": "Full sun for optimal growth and flowering.",
    "diseases": "Royal poinciana trees are relatively resistant to diseases but may occasionally be affected by fungal infections, root rot, or leaf spot.",
    "solutions": "Practice good garden hygiene, avoid overwatering or waterlogging, and treat with fungicides if necessary.",
    "fertilizers": "Royal poinciana trees are relatively low-maintenance and do not require heavy fertilization. A balanced fertilizer applied at planting time is usually sufficient.",
    "season": "Late spring to early fall"
    },
    {
    "name": "Plumeria",
    "description": "Plumeria, also known as frangipani, is a genus of flowering plants in the dogbane family, Apocynaceae. They are native to tropical and subtropical regions of the Americas, Africa, and Asia.",
    "origin": "Tropical and subtropical regions of the Americas, Africa, and Asia",
    "uses": "Plumeria flowers are prized for their fragrant, showy blooms, which are used in leis, garlands, and as ornamental decorations. They are also used in perfumery and traditional medicine.",
    "cultivation": "Plumeria plants prefer full sun and well-drained soil. They are relatively easy to grow from cuttings or grafts and can be grown in containers or as landscape plants.",
    "imageUrl": "https://images.pexels.com/photos/635280/pexels-photo-635280.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Plumeria flowers come in various colors, including white, yellow, pink, and red, and have a distinctively sweet fragrance. They typically have five petals and a central, tubular corolla.",
    "instructions": "Plant plumeria in well-drained soil with good organic matter. Water regularly, especially during dry periods, and provide protection from strong winds.",
    "water": "Plumeria plants require regular watering, especially during dry periods and flowering.",
    "sunlight": "Full sun for optimal growth and flowering.",
    "diseases": "Common diseases include powdery mildew, frangipani rust, and stem rot.",
    "solutions": "Practice good garden hygiene, avoid overwatering or waterlogging, and treat with fungicides if necessary.",
    "fertilizers": "Plumeria plants benefit from regular fertilization during the growing season, with a balanced fertilizer formulated for flowering plants.",
    "season": "Late spring to early fall"
    },
    {
    "name": "Monsoon Cassia",
    "description": "Monsoon cassia, also known as rainbow shower tree, is a species of flowering plant in the pea family, Fabaceae. It is native to Southeast Asia but has been introduced to other tropical and subtropical regions worldwide.",
    "origin": "Southeast Asia",
    "uses": "Monsoon cassia is primarily grown for its colorful and fragrant blooms, which are used ornamentally in landscaping, gardens, and parks. They are also used in traditional medicine.",
    "cultivation": "Monsoon cassia trees prefer full sun and well-drained soil. They are relatively easy to grow from seeds or transplants and can tolerate a range of soil conditions.",
    "imageUrl": "https://images.pexels.com/photos/16769723/pexels-photo-16769723/free-photo-of-close-up-of-a-golden-shower-tree-flowers.jpeg?auto=compress&cs=tinysrgb&w=600",
    "details": "Monsoon cassia trees are deciduous and can grow up to 30-40 feet tall with a spread of 20-30 feet. They produce large clusters of yellow or pink flowers with a sweet fragrance.",
    "instructions": "Plant monsoon cassia in well-drained soil with good organic matter. Water regularly, especially during the growing season, and provide protection from strong winds.",
    "water": "Monsoon cassia trees require regular watering, especially during periods of drought and flowering.",
    "sunlight": "Full sun for optimal growth and flowering.",
    "diseases": "Monsoon cassia trees are relatively resistant to diseases but may occasionally be affected by fungal infections, root rot, or leaf spot.",
    "solutions": "Practice good garden hygiene, avoid overwatering or waterlogging, and treat with fungicides if necessary.",
    "fertilizers": "Monsoon cassia trees are relatively low-maintenance and do not require heavy fertilization. A balanced fertilizer applied at planting time is usually sufficient.",
    "season": "Late spring to early fall"
    }
    ]