[
    {
      "name": "Litchi",
      "description": "Litchi is a tropical fruit known for its sweet and juicy flesh. It belongs to the soapberry family (Sapindaceae) and is native to South China.",
      "origin": "South China",
      "nutrition": "Litchis are rich in vitamin C, antioxidants, and various minerals. They are low in calories and fat but high in natural sugars.",
      "uses": "Litchis are typically eaten fresh as a snack or dessert. They can also be used in fruit salads, smoothies, cocktails, and various culinary dishes.",
      "cultivation": "Litchi trees thrive in warm, subtropical climates with well-drained soil and ample sunlight. They are typically grown from seeds or propagated by grafting.",
      "imageUrl": "https://images.pexels.com/photos/17201892/pexels-photo-17201892/free-photo-of-red-litchi-fruit.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Litchis have a rough, pinkish-red skin that surrounds translucent, jelly-like flesh. Each fruit contains a single large seed in the center.",
      "instructions": "Plant litchi seeds in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Litchi trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include anthracnose, powdery mildew, root rot, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Summer"
    },
    {
      "name": "Jamun",
      "description": "Jamun, also known as Java plum or black plum, is a tropical fruit known for its sweet and tangy flavor. It belongs to the flowering plant family Myrtaceae.",
      "origin": "India",
      "nutrition": "Jamuns are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, antioxidants, and anthocyanins.",
      "uses": "Jamuns are typically eaten fresh as a snack or dessert. They can also be used to make jams, jellies, juices, and alcoholic beverages.",
      "cultivation": "Jamun trees thrive in warm, tropical climates with well-drained soil and ample sunlight. They are typically grown from seeds or propagated by grafting.",
      "imageUrl": "https://media.istockphoto.com/id/1499483405/photo/a-closeup-selective-focus-picture-of-black-jamun-or-eugenia-jambolana-or-aro-black-jambolan.jpg?b=1&s=612x612&w=0&k=20&c=fN5mTqt6Zv_y3OWLFQ78U3J2MsnLgNKNKHQEoVcd7Fk=",
      "details": "Jamuns have a smooth, purple to black skin that surrounds juicy, pinkish-purple flesh. Each fruit contains a single large seed in the center.",
      "instructions": "Plant jamun seeds in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Jamun trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include powdery mildew, anthracnose, fruit rot, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Summer"
    },
    {
      "name": "Plums",
      "description": "Plums are stone fruits known for their sweet and juicy flesh. They belong to the Rosaceae family and are closely related to peaches, cherries, and apricots.",
      "origin": "Asia",
      "nutrition": "Plums are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin K, potassium, and antioxidants.",
      "uses": "Plums are typically eaten fresh as a snack or dessert. They can also be used to make jams, jellies, sauces, and baked goods.",
      "cultivation": "Plum trees thrive in temperate climates with well-drained soil and ample sunlight. They are typically grown from seeds, seedlings, or grafted trees.",
      "imageUrl": "https://images.pexels.com/photos/6208157/pexels-photo-6208157.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Plums have smooth, often waxy skin that surrounds juicy, sweet or tart flesh. They come in various colors, including red, purple, yellow, and green.",
      "instructions": "Plant plum trees in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Plum trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include plum pox virus, brown rot, bacterial canker, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Summer"
    },
    {
      "name": "Cherry",
      "description": "Cherries are stone fruits known for their sweet and tart flavor. They belong to the Rosaceae family and are closely related to plums, peaches, and apricots.",
      "origin": "Asia",
      "nutrition": "Cherries are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, potassium, and antioxidants.",
      "uses": "Cherries are typically eaten fresh as a snack or dessert. They can also be used to make jams, jellies, sauces, and baked goods.",
      "cultivation": "Cherry trees thrive in temperate climates with well-drained soil and ample sunlight. They are typically grown from seeds, seedlings, or grafted trees.",
      "imageUrl": "https://images.pexels.com/photos/162689/cherry-pair-fruits-sweet-162689.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Cherries have smooth, often waxy skin that surrounds juicy, sweet or tart flesh. They come in various colors, including red, black, and yellow.",
      "instructions": "Plant cherry trees in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Cherry trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include cherry leaf spot, brown rot, powdery mildew, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Summer"
    },
    {
      "name": "Peach",
      "description": "Peaches are stone fruits known for their sweet and juicy flesh. They belong to the Rosaceae family and are closely related to plums, cherries, and apricots.",
      "origin": "Northwest China",
      "nutrition": "Peaches are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin A, potassium, and antioxidants.",
      "uses": "Peaches are typically eaten fresh as a snack or dessert. They can also be used to make jams, jellies, sauces, and baked goods.",
      "cultivation": "Peach trees thrive in temperate climates with well-drained soil and ample sunlight. They are typically grown from seeds, seedlings, or grafted trees.",
      "imageUrl": "https://images.pexels.com/photos/2255965/pexels-photo-2255965.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Peaches have fuzzy skin that surrounds juicy, sweet or tart flesh. They come in various colors, including yellow, white, and red.",
      "instructions": "Plant peach trees in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Peach trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include peach leaf curl, brown rot, powdery mildew, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Summer"
    },
    {
      "name": "Pear",
      "description": "Pears are sweet and juicy fruits known for their distinctive bell shape and crisp texture. They belong to the Rosaceae family and are closely related to apples.",
      "origin": "Europe and Asia",
      "nutrition": "Pears are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin K, potassium, and antioxidants.",
      "uses": "Pears are typically eaten fresh as a snack or dessert. They can also be used in salads, sauces, baked goods, and preserves.",
      "cultivation": "Pear trees thrive in temperate climates with well-drained soil and ample sunlight. They are typically grown from seeds, seedlings, or grafted trees.",
      "imageUrl": "https://images.pexels.com/photos/2095571/pexels-photo-2095571.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Pears have smooth skin that can range in color from green to yellow to red. They have crisp, juicy flesh with a sweet and slightly tart flavor.",
      "instructions": "Plant pear trees in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Pear trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun to partial shade.",
      "diseases": "Common diseases include fire blight, pear scab, powdery mildew, and various fungal infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Late summer to early fall"
    },
    {
      "name": "Melon",
      "description": "Melons are juicy and refreshing fruits known for their sweet flavor and high water content. They belong to the Cucurbitaceae family, which also includes cucumbers, squash, and pumpkins.",
      "origin": "Africa and Asia",
      "nutrition": "Melons are low in calories and rich in water, vitamins, and minerals. They are particularly high in vitamin C, vitamin A, potassium, and antioxidants.",
      "uses": "Melons are typically eaten fresh as a snack or dessert. They can also be used in fruit salads, smoothies, juices, and cocktails.",
      "cultivation": "Melons thrive in warm, sunny climates with well-drained soil. They are typically grown from seeds directly in the garden or in containers.",
      "imageUrl": "https://images.pexels.com/photos/39350/melon-ham-fruit-meat-39350.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
      "details": "Melons come in various shapes, sizes, colors, and flavors, including cantaloupe, honeydew, watermelon, and casaba. They have a sweet, juicy flesh and seeds in the center.",
      "instructions": "Plant melon seeds in well-drained soil in a sunny location after the danger of frost has passed. Provide support for vining varieties and space plants according to their mature size.",
      "water": "Melons require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun for at least 6-8 hours a day.",
      "diseases": "Common diseases include powdery mildew, downy mildew, fusarium wilt, and various fungal infections.",
      "solutions": "Practice crop rotation, use disease-resistant varieties, provide good air circulation, and avoid overhead watering.",
      "fertilizers": "Use balanced fertilizers with higher phosphorus levels for fruit development. Avoid excessive nitrogen, which can promote lush foliage at the expense of fruiting.",
      "season": "Summer"
    },
    {
      "name": "Pomegranate",
      "description": "Pomegranate is a tropical fruit known for its juicy arils and tangy flavor. It belongs to the family Lythraceae and is native to the Middle East.",
      "origin": "Middle East",
      "nutrition": "Pomegranates are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin K, potassium, and antioxidants.",
      "uses": "Pomegranate arils are typically eaten fresh as a snack or dessert. They can also be used in salads, sauces, beverages, and desserts.",
      "cultivation": "Pomegranate trees thrive in warm, subtropical climates with well-drained soil and plenty of sunlight. They are typically grown from seeds, seedlings, or grafted trees.",
      "imageUrl": "https://images.pexels.com/photos/1115812/pexels-photo-1115812.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Pomegranates have a thick, leathery skin that surrounds juicy, ruby-red arils. Each aril contains a seed surrounded by a flavorful pulp.",
      "instructions": "Plant pomegranate trees in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Pomegranate trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun for at least 6-8 hours a day.",
      "diseases": "Common diseases include fungal infections, root rot, and bacterial blight.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Late summer to early fall"
    },
    {
      "name": "Custard Apple",
      "description": "Custard apple, also known as sugar apple or sweetsop, is a tropical fruit known for its sweet and creamy flesh. It belongs to the Annonaceae family.",
      "origin": "South America",
      "nutrition": "Custard apples are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin B6, potassium, and antioxidants.",
      "uses": "Custard apples are typically eaten fresh as a snack or dessert. They can also be used in smoothies, milkshakes, ice creams, and desserts.",
      "cultivation": "Custard apple trees thrive in warm, tropical climates with well-drained soil and plenty of sunlight. They are typically grown from seeds or propagated by grafting.",
      "imageUrl": "https://images.pexels.com/photos/2957793/pexels-photo-2957793.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Custard apples have a green, knobby skin that surrounds soft, creamy flesh with numerous black seeds. The flesh has a sweet, custard-like flavor.",
      "instructions": "Plant custard apple seeds in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Custard apple trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun for at least 6-8 hours a day.",
      "diseases": "Common diseases include anthracnose, powdery mildew, and fruit rot.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Late summer to early fall"
    },
    {
      "name": "Mango",
      "description": "Mango is a tropical fruit known for its sweet and juicy flesh. It belongs to the flowering plant family Anacardiaceae and is native to South Asia.",
      "origin": "South Asia",
      "nutrition": "Mangoes are low in calories and rich in fiber, vitamins, and minerals. They are particularly high in vitamin C, vitamin A, potassium, and antioxidants.",
      "uses": "Mangoes are typically eaten fresh as a snack or dessert. They can also be used in salads, smoothies, juices, sauces, and desserts.",
      "cultivation": "Mango trees thrive in warm, tropical climates with well-drained soil and plenty of sunlight. They are typically grown from seeds or propagated by grafting.",
      "imageUrl": "https://images.pexels.com/photos/2667738/pexels-photo-2667738.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Mangoes have smooth, often waxy skin that can range in color from green to yellow to red. The flesh is juicy, sweet, and fragrant, with a large, flat seed in the center.",
      "instructions": "Plant mango seeds in well-drained soil in a sunny location. Keep the soil consistently moist but not waterlogged. Prune trees regularly to promote airflow and fruit production.",
      "water": "Mango trees require regular watering, especially during dry periods and fruit development.",
      "sunlight": "Full sun for at least 6-8 hours a day.",
      "diseases": "Common diseases include anthracnose, powdery mildew, black spot, and bacterial infections.",
      "solutions": "Practice good orchard hygiene, prune infected branches, apply fungicides if necessary, and provide proper air circulation.",
      "fertilizers": "Apply a balanced fertilizer with a higher potassium content to promote fruiting. Avoid excessive nitrogen, which can lead to vegetative growth at the expense of fruit production.",
      "season": "Late spring to early fall"
    }
  ]
  