[
  {
    "name": "Tomatoes",
    "origin": "South America",
    "description": "Tomatoes are a type of fruit known for their vibrant color and variety of uses. They are one of the most popular garden plants and come in a range of sizes, colors, and shapes.",
    "nutrition": "Rich in vitamin C, potassium, folate, and vitamin K. They are also a great source of the antioxidant lycopene, which has been linked to many health benefits.",
    "uses": "Can be used in a variety of dishes, sauces, salads, and drinks. They can be eaten raw or cooked, and are often canned for use in winter months.",
    "cultivation": "Start seeds indoors 6-8 weeks before last frost. Transplant seedlings when soil warms and nighttime temperatures stay above 50°F. Provide sturdy stakes or cages for support. Space plants 2-3 feet apart for optimal growth.",
    "imageUrl": "https://images.unsplash.com/photo-1561136594-7f68413baa99?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "details": "Juicy, flavorful fruits in various sizes, colors, and shapes. Indeterminate varieties continue producing throughout the season, while determinate varieties have a concentrated harvest period.",
    "instructions": "Start seeds indoors 6-8 weeks before last frost. Transplant seedlings when soil warms and nighttime temperatures stay above 50°F. Provide sturdy stakes or cages for support. Space plants 2-3 feet apart for optimal growth.",
    "water": "Deep, consistent watering, especially during fruiting. Aim for 1-2 inches of water per week. Mulch around plants to retain soil moisture.",
    "sunlight": "Full sun (at least 6-8 hours daily). Tomatoes thrive in warm temperatures.",
    "diseases": "Blossom end rot, blight, bacterial wilt, septoria leaf spot, fusarium wilt.",
    "solutions": "Maintain consistent soil moisture with drip irrigation, avoid overhead watering, remove affected foliage, consider resistant varieties. Use organic fungicides if necessary.",
    "fertilizers": "Balanced fertilizer at planting, then lower-nitrogen fertilizer once fruiting begins. Consider adding calcium to the soil to prevent blossom end rot.",
    "additionalTips": "Prune determinate varieties for better air circulation and larger fruits. For indeterminate varieties, pinch off suckers to focus the plant's energy on fruit production.",
    "season": "summer"
  },
  {
    "name": "Cucumbers",
    "origin": "Northern India",
    "description": "Cucumbers are a type of gourd that come from the same family as watermelon, zucchini, and other squash. Known for their refreshing and hydrating properties, they are composed of about 96% water.",
    "nutrition": "Low in calories but high in many important vitamins and minerals, including vitamin K, vitamin C, magnesium, potassium, and manganese. They also contain antioxidants, including flavonoids and tannins.",
    "uses": "Can be eaten fresh or pickled. Commonly used in a variety of dishes and can be used to make sauces, salads, sandwiches, and other foods.",
    "cultivation": "Thrive in good sunlight and require ample soil moisture. Susceptible to several common garden pests, including powdery mildew and cucumber beetles.",
    "imageUrl": "https://images.unsplash.com/photo-1568584711271-6c929fb49b60?q=80&w=1472&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "details": "Refreshing, crisp fruits. Choose bush varieties for smaller spaces or vining varieties for higher yields.",
    "instructions": "Direct sow seeds after last frost or start indoors. Provide trellis or support for vining types.",
    "water": "Consistent moisture, especially important during flowering and fruiting.",
    "sunlight": "Full sun.",
    "diseases": "Powdery mildew, downy mildew, cucumber mosaic virus.",
    "solutions": "Proper spacing for air circulation, avoid overhead watering, use fungicides if necessary, choose disease-resistant varieties.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Peppers",
    "origin": "Central and South America",
    "description": "Peppers are a type of fruit that come in a variety of colors, shapes, and flavors. They can range from sweet to extremely spicy, depending on the variety.",
    "nutrition": "High in vitamins A and C, potassium, folic acid, and fiber. They also contain capsaicin, which has been linked to numerous health benefits.",
    "uses": "Can be used in a variety of dishes, including salads, stir-fries, and sauces. They can be eaten raw, cooked, or dried.",
    "cultivation": "Start seeds indoors 8-10 weeks before last frost. Transplant seedlings when soil warms. Provide support for plants as they grow.",
    "imageUrl": "https://images.unsplash.com/photo-1607546900609-7efd29a4a2dd?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "details": "Sweet or spicy varieties in a range of colors and shapes.",
    "instructions": "Start seeds indoors 8-10 weeks before last frost. Transplant seedlings when soil warms.",
    "water": "Deep, regular watering, especially during flowering and fruiting.",
    "sunlight": "Full sun.",
    "diseases": "Blossom end rot, bacterial spot, viruses.",
    "solutions": "Maintain consistent soil moisture, remove affected foliage, choose disease-resistant varieties.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Beans (Bush)",
    "origin": "Central and South America",
    "description": "Bush beans are a type of bean plant that grows as a compact bush, making them a great choice for small gardens. They produce tender, flavorful pods that are excellent for fresh eating, canning, and freezing.",
    "nutrition": "High in fiber, protein, iron, and complex carbohydrates. They also contain a variety of vitamins and minerals.",
    "uses": "Can be used in a variety of dishes, including salads, soups, and casseroles. They can be eaten fresh, canned, or frozen.",
    "cultivation": "Direct sow seeds after last frost. Plant in succession for an extended harvest. Do not need support like pole beans.",
    "imageUrl": "https://images.unsplash.com/photo-1574963835594-61eede2070dc?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "details": "Tender, flavorful pods. Harvest regularly to encourage continued production.",
    "instructions": "Direct sow seeds after last frost. Plant in succession for an extended harvest.",
    "water": "Moderate watering, avoid soggy soil.",
    "sunlight": "Full sun.",
    "diseases": "Rust, blight, mosaic virus.",
    "solutions": "Proper spacing, avoid overhead watering, choose disease-resistant varieties.",
    "fertilizers": "Usually don't need fertilizer as they fix nitrogen in the soil.",
    "season": "summer"
  },
  {
    "name": "Carrots",
    "origin": "Afghanistan",
    "description": "Carrots are a root vegetable known for their bright orange color and sweet flavor. They are a versatile vegetable that can be eaten raw or cooked in a variety of dishes.",
    "nutrition": "High in beta-carotene, fiber, vitamin K1, potassium, and antioxidants. They are also low in calories and have been linked to numerous health benefits.",
    "uses": "Can be eaten raw, cooked, or juiced. Commonly used in salads, soups, stews, and side dishes.",
    "cultivation": "Direct sow seeds in loose, well-draining soil. Thin seedlings to allow room for roots to develop. Mulch to retain soil moisture and prevent weeds.",
    "imageUrl": "https://images.unsplash.com/photo-1582515073490-39981397c445?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8Y2Fycm90fGVufDB8fDB8fHww",
    "details": "Sweet, crunchy roots in various colors and shapes. Choose shorter varieties for heavy or rocky soil.",
    "instructions": "Direct sow seeds in loose, well-draining soil. Thin seedlings to allow room for roots to develop.",
    "water": "Consistent moisture, especially during germination and root development.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Carrot rust fly, carrot weevil, damping off.",
    "solutions": "Use row covers, crop rotation, and companion planting to deter pests. Practice good garden hygiene to prevent disease.",
    "fertilizers": "Avoid high-nitrogen fertilizers, which can cause forked roots. Use a balanced fertilizer at planting.",
    "season": "summer"
  },
  {
    "name": "Lettuce",
    "origin": "Egypt",
    "description": "Lettuce is a leafy green vegetable that is commonly used in salads and sandwiches. It is known for its crisp texture and mild flavor.",
    "nutrition": "Low in calories but high in vitamins A and K, folate, and fiber. It also contains antioxidants and other important nutrients.",
    "uses": "Can be eaten fresh in salads, sandwiches, wraps, and other dishes. Can also be cooked or used as a garnish.",
    "cultivation": "Direct sow seeds in cool weather. Keep soil consistently moist and provide shade in hot weather to prevent bolting.",
    "imageUrl": "https://images.unsplash.com/photo-1622206151226-18ca2c9ab4a1?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8bGV0dHVjZXxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Crisp, flavorful leaves in various colors and shapes. Choose loose-leaf varieties for cut-and-come-again harvests.",
    "instructions": "Direct sow seeds in cool weather. Keep soil consistently moist and provide shade in hot weather to prevent bolting.",
    "water": "Consistent moisture, especially during germination and leaf development.",
    "sunlight": "Partial shade in hot weather, full sun in cooler weather.",
    "diseases": "Downy mildew, powdery mildew, damping off.",
    "solutions": "Proper spacing for air circulation, avoid overhead watering, use fungicides if necessary.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Okra (Bhindi)",
    "origin": "Africa",
    "description": "Okra, also known as Bhindi, is a warm-season vegetable that is easy to grow in most soils. The pods are best harvested when they are young and tender.",
    "nutrition": "Rich in magnesium, folate, fiber, antioxidants, and vitamin C, K1, and A.",
    "uses": "Can be used in a variety of dishes, including stews, soups, and salads. They can be eaten raw, cooked, or pickled.",
    "cultivation": "Direct sow seeds after last frost. Plant in full sun and well-drained soil. Harvest pods when they are 2-3 inches long for best flavor.",
    "imageUrl": "https://images.unsplash.com/photo-1425543103986-22abb7d7e8d2?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8b2tyYXxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Tender, flavorful pods. Harvest regularly to encourage continued production.",
    "instructions": "Direct sow seeds after last frost. Plant in full sun and well-drained soil. Harvest pods when they are 2-3 inches long for best flavor.",
    "water": "Regular watering, especially during dry periods.",
    "sunlight": "Full sun.",
    "diseases": "Powdery mildew, verticillium wilt.",
    "solutions": "Proper spacing for air circulation, avoid overhead watering, choose disease-resistant varieties.",
    "fertilizers": "Use a balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Radishes",
    "origin": "China",
    "description": "Radishes are a root vegetable known for their crisp texture and peppery flavor. They are quick-growing and easy to grow, making them a popular choice for beginner gardeners.",
    "nutrition": "Low in calories but high in fiber, vitamin C, and other important nutrients. They are also a good source of antioxidants.",
    "uses": "Can be eaten raw, cooked, or pickled. Commonly used in salads, sandwiches, and other dishes.",
    "cultivation": "Direct sow seeds in loose, well-draining soil. Thin seedlings to allow room for roots to develop. Harvest when roots are young and tender.",
    "imageUrl": "https://images.unsplash.com/photo-1585369496178-144fd937f249?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8cmFkaXNofGVufDB8fDB8fHww",
    "details": "Crisp, peppery roots in various colors and shapes. Harvest when young for best flavor.",
    "instructions": "Direct sow seeds in loose, well-draining soil. Thin seedlings to allow room for roots to develop. Harvest when roots are young and tender.",
    "water": "Consistent moisture, especially during germination and root development.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Root rot, damping off, clubroot.",
    "solutions": "Practice good garden hygiene, avoid overwatering, choose disease-resistant varieties.",
    "fertilizers": "Avoid high-nitrogen fertilizers, which can cause excessive foliage growth. Use a balanced fertilizer at planting.",
    "season": "summer"
  },
  {
    "name": "Spinach",
    "origin": "Persia",
    "description": "Spinach is a leafy green vegetable known for its high nutritional value and versatility in cooking. It is rich in vitamins, minerals, and antioxidants.",
    "nutrition": "High in vitamins A, C, K1, and folic acid, as well as iron, calcium, and potassium. It is also low in calories and has    been linked to numerous health benefits.",
    "uses": "Can be eaten fresh in salads, sandwiches, and smoothies. Can also be cooked in a variety of dishes, including soups, stews, and casseroles.",
    "cultivation": "Direct sow seeds in cool weather. Keep soil consistently moist and provide shade in hot weather to prevent bolting.",
    "imageUrl": "https://images.unsplash.com/photo-1576045057995-568f588f82fb?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8U3BpbmFjaHxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Nutrient-rich leaves in various colors and shapes. Harvest regularly to encourage continued production.",
    "instructions": "Direct sow seeds in cool weather. Keep soil consistently moist and provide shade in hot weather to prevent bolting.",
    "water": "Consistent moisture, especially during germination and leaf development.",
    "sunlight": "Partial shade in hot weather, full sun in cooler weather.",
    "diseases": "Downy mildew, powdery mildew, damping off.",
    "solutions": "Proper spacing for air circulation, avoid overhead watering, use fungicides if necessary.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  }
]
