[
  {
    "name": "Watermelon",
    "origin": "Africa",
    "description": "Large, round fruit with a sweet, juicy flesh and a green rind. A quintessential summer treat.",
    "nutrition": "High in water content, vitamin C, vitamin A, and lycopene.  A great source of hydration.",
    "uses": "Eaten fresh, used in juices, salads, and smoothies.",
    "cultivation": "Vining plant that requires ample space and warm soil. Needs consistent watering throughout the season.",
    "imageUrl": "https://images.unsplash.com/photo-1563114773-84221bd62daa?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8d2F0ZXJtZWxvbnxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Flesh can be red, pink, yellow, or orange. Choose heavy melons that sound hollow when tapped.",
    "instructions": "Store whole watermelons at room temperature, cut pieces should be refrigerated.",
    "water": "Deep, consistent watering, especially during flowering and fruiting.",
    "sunlight": "Full sun.",
    "diseases": "Powdery mildew, downy mildew, anthracnose.",
    "solutions": "Proper spacing, avoid overhead watering, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Mango",
    "origin": "India",
    "description": "Juicy, sweet fruit with a vibrant yellow-orange flesh. Known as the 'king of fruits' in many regions.",
    "nutrition": "Rich in vitamins A and C, fiber, and antioxidants. Contains unique compounds like mangiferin.",
    "uses": "Eaten fresh, used in juices, smoothies, salads, desserts, and preserves.",
    "cultivation": "Grows on large evergreen trees. Prefers warm climates with distinct dry periods.",
    "imageUrl": "https://images.unsplash.com/photo-1623930376395-0f3ad22cfac2?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjZ8fG1hbmdvfGVufDB8fDB8fHww",
    "details": "Many varieties with different shapes, sizes, and flavors. Ripe mangoes are slightly soft and fragrant.",
    "instructions": "Purchase ripe mangoes or allow to ripen at room temperature if purchased firm.",
    "water": "Deep, infrequent watering for established trees.",
    "sunlight": "Full sun.",
    "diseases": "Powdery mildew, anthracnose, mango malformation.",
    "solutions": "Proper pruning for air circulation, fungicide applications if necessary, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer for young trees, specialized mango fertilizer for mature trees.",
    "season": "summer"
  },
  {
    "name": "Pineapple",
    "origin": "South America",
    "description": "Sweet, tangy fruit with a spiky skin and a crown of leaves. Contains bromelain, an enzyme with health benefits.",
    "nutrition": "Rich in vitamin C, manganese, and antioxidants. Contains bromelain, an enzyme with anti-inflammatory properties.",
    "uses": "Eaten fresh, used in juices, salads, desserts, and savory dishes.",
    "cultivation": "Grows on a low, herbaceous plant with sword-like leaves. Prefers warm, tropical climates.",
    "imageUrl": "https://images.unsplash.com/photo-1558195955-c4751542e89b?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mjh8fHBpbmVhcHBsZXxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Takes 1-2 years to fruit after planting. Ripe pineapples are fragrant and slightly soft.",
    "instructions": "Choose pineapples with healthy leaves and a firm base. Store at room temperature until ripe.",
    "water": "Regular watering during the growing season, reduce watering during the dormant period.",
    "sunlight": "Full sun.",
    "diseases": "Pineapple fusarium wilt, pink disease, root rot.",
    "solutions": "Proper drainage, avoid overwatering, remove infected plants.",
    "fertilizers": "Balanced fertilizer during the growing season, avoid high-nitrogen fertilizers.",
    "season": "summer"
  },
  {
    "name": "Strawberry",
    "origin": "Europe",
    "description": "Small, sweet fruit with a bright red color and a juicy texture. Grows on low, spreading plants.",
    "nutrition": "High in vitamin C, manganese, and antioxidants. Contains ellagic acid, a compound with health benefits.",
    "uses": "Eaten fresh, used in desserts, salads, smoothies, and preserves.",
    "cultivation": "Grows on low, spreading plants. Prefers cool climates and well-draining soil.",
    "imageUrl": "https://images.unsplash.com/photo-1594282241894-4da286138f44?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjN8fHN0cmF3YmVycnl8ZW58MHx8MHx8fDA%3D",
    "details": "Many varieties with different flavors, sizes, and shapes. Ripe strawberries are fragrant and bright red or pink.",
    "instructions": "Choose strawberries with bright color and fresh green leaves. Store in the refrigerator and consume quickly.",
    "water": "Regular watering, especially during flowering and fruiting.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Powdery mildew, botrytis fruit rot, verticillium wilt.",
    "solutions": "Proper spacing for air circulation, remove infected plants, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer at planting, side-dress with compost during the season.",
    "season": "summer"
  },
  {
    "name": "Banana",
    "origin": "Southeast Asia",
    "description": "Sweet, creamy fruit with a distinctive shape and a yellow skin. Grows in clusters on tall, tropical plants.",
    "nutrition": "High in potassium, vitamin C, vitamin B6, and fiber. Contains unique compounds like dopamine and catechins.",
    "uses": "Eaten fresh, used in smoothies, desserts, and baked goods.",
    "cultivation": "Grows on tall, tropical plants. Prefers warm, humid climates with rich, well-draining soil.",
    "imageUrl": "https://images.unsplash.com/photo-1584781847001-8950419ae339?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OTl8fGJhbmFuYXxlbnwwfHwwfHx8MA%3D%3D",
    "details": "Many varieties with different flavors, sizes, and colors. Ripe bananas are yellow with brown spots.",
    "instructions": "Choose bananas with yellow skin and brown spots. Store at room temperature until ripe.",
    "water": "Regular watering, especially during the growing season.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Panama disease, black sigatoka, banana bunchy top virus.",
    "solutions": "Proper sanitation, remove infected plants, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer during the growing season, avoid high-nitrogen fertilizers.",
    "season": "summer"
  },
  {
    "name": "Litchi (Lychee)",
    "origin": "Southern China",
    "description": "Small, round fruit with a rough, red skin and sweet, translucent-white flesh. Unique floral aroma.",
    "nutrition": "Good source of vitamin C, potassium, and copper. Contains polyphenols with antioxidant properties.",
    "uses": "Eaten fresh, used in desserts, juices, and cocktails.",
    "cultivation": "Grows on medium-sized evergreen trees. Thrives in subtropical climates with warm summers and cool winters.",
    "imageUrl": "https://plus.unsplash.com/premium_photo-1681826695219-51ad7e8eb72f?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8bGl0Y2hpfGVufDB8fDB8fHww",
    "details": "The flesh surrounds a single, inedible seed. Ripe litchis have slightly soft skin and a sweet, fragrant smell.",
    "instructions": "Choose litchis with bright red skin and a slight give when pressed. Store at room temperature for a few days or refrigerate to extend shelf-life.",
    "water": "Regular, deep watering, especially during flowering and fruiting.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Leaf blight, anthracnose, litchi bugs.",
    "solutions": "Proper sanitation, fungicide applications if necessary, pest control measures.",
    "fertilizers": "Balanced fertilizer with micronutrients.",
    "season": "summer"
  },
  {
    "name": "Papaya",
    "origin": "Central America",
    "description": "Sweet, tropical fruit with a vibrant orange flesh and a green or yellow skin. Grows on tall, tropical plants.",
    "nutrition": "High in vitamin C, vitamin A, fiber, and antioxidants. Contains unique compounds like papain and carpaine.",
    "uses": "Eaten fresh, used in juices, smoothies, salads, and desserts.",
    "cultivation": "Grows on tall, tropical plants. Prefers warm, tropical climates with well-draining soil.",
    "imageUrl": "https://images.unsplash.com/photo-1617112848923-cc2234396a8d?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8cGFwYXlhfGVufDB8fDB8fHww",
    "details": "Many varieties with different flavors, sizes, and shapes. Ripe papayas are slightly soft and fragrant.",
    "instructions": "Choose papayas with firm skin and a slight give when pressed. Store at room temperature until ripe.",
    "water": "Regular watering, especially during the growing season.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Papaya ringspot virus, powdery mildew, anthracnose.",
    "solutions": "Proper sanitation, remove infected plants, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer during the growing season, avoid high-nitrogen fertilizers.",
    "season": "summer"
  },
  {
    "name": "Grapes",
    "origin": "Europe",
    "description": "Sweet, juicy fruit with a variety of colors, flavors, and textures. Grows on woody vines known as grapevines.",
    "nutrition": "High in vitamins C and K, antioxidants, and resveratrol. Contains unique compounds like quercetin and catechins.",
    "uses": "Eaten fresh, used in juices, wines, jams, jellies, and desserts.",
    "cultivation": "Grows on woody vines known as grapevines. Prefers warm, temperate climates with well-draining soil.",
    "imageUrl": "https://images.unsplash.com/photo-1599819177626-b50f9dd21c9b?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTF8fGdyYXBlc3xlbnwwfHwwfHx8MA%3D%3D",
    "details": "Many    varieties with different flavors, colors, and uses. Ripe grapes are plump, firm, and sweet.",
    "instructions": "Choose grapes with plump, firm skin and a slight give when pressed. Store in the refrigerator and consume quickly.",
    "water": "Regular watering, especially during the growing season.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Powdery mildew, downy mildew, black rot.",
    "solutions": "Proper pruning for air circulation, fungicide applications if necessary, choose resistant varieties.",
    "fertilizers": "Balanced fertilizer during the growing season, avoid high-nitrogen fertilizers.",
    "season": "summer"
  },
  {
    "name": "Blueberries",
    "origin": "North America",
    "description": "Sweet, tangy fruit with a deep blue color and a juicy texture. Grows on low, spreading plants known as blueberry bushes.",
    "nutrition": "High in vitamins C and K, fiber, and antioxidants. Contains unique compounds like anthocyanins and pterostilbene.",
    "uses": "Eaten fresh, used in desserts, smoothies, salads, and baked goods.",
    "cultivation": "Grows on low, spreading plants known as blueberry bushes. Prefers cool, acidic soil with good drainage.",
    "imageUrl": "https://images.unsplash.com/photo-1498557850523-fd3d118b962e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8Ymx1ZWJlcnJpZXN8ZW58MHx8MHx8fDA%3D",
    "details": "Many varieties with different flavors, sizes, and colors. Ripe blueberries are plump, firm, and sweet.",
    "instructions": "Choose blueberries with a deep blue color and a slight white bloom. Store in the refrigerator and consume quickly.",
    "water": "Regular watering, especially during the growing season.",
    "sunlight": "Full sun to partial shade.",
    "diseases": "Mummy berry, anthracnose, phytophthora root rot.",
    "solutions": "Proper pruning for air circulation, remove infected plants, choose resistant varieties.",
    "fertilizers": "Acidic fertilizer for blueberries, avoid high-nitrogen fertilizers.",
    "season": "summer"
  }
]
